In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import folium

In [2]:
plt.style.use('ggplot')

In [10]:
sixty = pd.read_csv('../data/860m_clean.csv')
sixtyone = pd.read_csv('../data/861m_clean.csv')
combined = pd.read_csv('../data/combined.csv')

In [11]:
sixty.head()

,UTILITYNUMBER,UTILITYNAME,PLANTID,PLANTNAME,NETSUMMERCAPACITY(MW),LATITUDE,LONGITUDE,MONTH,NAMEPLATECAPACITY(MW),NETWINTERCAPACITY(MW),DATAYEAR,GEN_TYPE
0,195,Alabama Power Co,2.0,Bankhead Dam,56.0,33.458665,-87.356823,1,56.0,56.0,2016,hydroelectric
1,195,Alabama Power Co,3.0,Barry,138.0,31.006900,-88.010300,1,138.0,138.0,2016,coal
2,195,Alabama Power Co,3.0,Barry,137.0,31.006900,-88.010300,1,137.0,137.0,2016,coal
3,195,Alabama Power Co,3.0,Barry,249.0,31.006900,-88.010300,1,249.0,249.0,2016,coal
4,195,Alabama Power Co,3.0,Barry,362.0,31.006900,-88.010300,1,362.0,362.0,2016,coal

In [13]:
sixtyone.head()

,DATAYEAR,MONTH,UTILITYNUMBER,TOTALREVENUE,TOTALSALES,TOTALCUSTOMERS,OWNERTYPE
0,2016,1,84,5863.315,52619.079,35170,2
1,2016,1,176,80.140,784.000,989,3
2,2016,1,195,439393.000,4872926.000,1459675,3
3,2016,1,213,4283.966,39417.826,16776,3
4,2016,1,219,1470.807,5414.652,7639,3

In [14]:
combined.head()

,DATAYEAR,MONTH,UTILITYNUMBER,NETSUMMERCAPACITY(MW),NETWINTERCAPACITY(MW),NAMEPLATECAPACITY(MW),is_coal,is_geothermal,is_hydroelectric,is_natural_gas,...,MW_HYDROELECTRIC,MW_NATURAL_GAS,MW_NUCLEAR,MW_OIL,MW_OTHER,MW_SOLAR,MW_WIND,TOTALREVENUE,TOTALSALES,TOTALCUSTOMERS
0,2016,1,84,5.4,5.4,5.4,0.000000,0.0,0.000000,0.000000,...,0.0,0.0,0.0,5.4,0.0,0.0,0.0,5863.315,52619.079,35170
1,2016,1,195,13431.8,13431.8,13431.8,0.244186,0.0,0.476744,0.244186,...,1673.7,2123.7,1757.0,16.0,0.0,0.0,0.0,439393.000,4872926.000,1459675
2,2016,1,213,196.6,196.6,196.6,0.000000,0.0,0.344828,0.000000,...,102.7,0.0,0.0,93.9,0.0,0.0,0.0,4283.966,39417.826,16776
3,2016,1,219,42.7,42.7,42.7,0.000000,0.0,0.210526,0.000000,...,14.4,0.0,0.0,28.3,0.0,0.0,0.0,1470.807,5414.652,7639
4,2016,1,221,54.7,54.7,54.7,0.000000,0.0,0.000000,0.000000,...,0.0,0.0,0.0,54.7,0.0,0.0,0.0,5015.000,11093.000,10887